backend/load-tests/scenarios/02-ramp-up.yml
# load-tests/scenarios/02-ramp-up.yml
# Scenario 2: Ramp-up — gradually increase load until breakpoint.
# Purpose: Find the user count where P95 latency crosses 2 seconds.
# Watch Grafana while this runs — you will see which panel degrades first.
#
# Usage: artillery run load-tests/scenarios/02-ramp-up.yml

config:
  target: "http://localhost:3001"
  http:
    timeout: 30

  phases:
    - name:        "Warm-up"
      duration:    60       # 1 minute at low load
      arrivalRate: 1
      maxVusers:   3

    - name:        "Ramp 5 → 20 users"
      duration:    120      # 2 minutes
      arrivalRate: 2
      rampTo:      8        # ramp to 8/s = ~20 concurrent
      maxVusers:   20

    - name:        "Ramp 20 → 50 users"
      duration:    120      # 2 minutes
      arrivalRate: 8
      rampTo:      15       # ramp to 15/s = ~50 concurrent
      maxVusers:   50

    - name:        "Sustain at 50"
      duration:    120      # 2 minutes sustained
      arrivalRate: 15
      maxVusers:   50

    - name:        "Cool-down"
      duration:    60       # 1 minute
      arrivalRate: 1
      maxVusers:   5

before:
  flow:
    - post:
        url:  "/api/v1/auth/login"
        name: "LOGIN"
        json:
          email:    "{{ $env.TEST_USER_EMAIL }}"
          password: "{{ $env.TEST_USER_PASSWORD }}"
        capture:
          - json: "$.data.tokens.accessToken"
            as:   "accessToken"

scenarios:
  - name:   "Mixed RAG workload"
    weight: 70
    flow:
      - post:
          url:  "/api/v1/rag/query"
          name: "RAG_QUERY"
          headers:
            Authorization: "Bearer {{ accessToken }}"
          json:
            query: "What are the main topics covered?"
            topK:  5
          expect:
            - statusCode: [200, 429]   # 429 is acceptable (rate limited)

  - name:   "Document operations"
    weight: 20
    flow:
      - get:
          url:  "/api/v1/documents"
          name: "LIST_DOCUMENTS"
          headers:
            Authorization: "Bearer {{ accessToken }}"
          expect:
            - statusCode: 200

  - name:   "Cache stats"
    weight: 10
    flow:
      - get:
          url:  "/api/v1/documents/cache/stats"
          name: "CACHE_STATS"
          headers:
            Authorization: "Bearer {{ accessToken }}"
          expect:
            - statusCode: 200