backend/load-tests/scenarios/03-cache-warming.yml
# load-tests/scenarios/03-cache-warming.yml
# Scenario 3: Cache warming — repeat the same query many times.
# Purpose: Measure the cache hit rate and latency improvement.
# Run this AFTER 02-ramp-up to see how caching changes the picture.
#
# Expected result:
#   First 10 requests (cache misses): P95 ~2-3s
#   Next 40 requests  (cache hits):   P95 ~1.5s (embedding cached)
#
# Usage: artillery run load-tests/scenarios/03-cache-warming.yml

config:
  target: "http://localhost:3001"
  http:
    timeout: 30

  phases:
    - name:        "Cache miss phase"
      duration:    30
      arrivalRate: 3
      maxVusers:   5

    - name:        "Cache hit phase"
      duration:    90
      arrivalRate: 10
      maxVusers:   20

before:
  flow:
    - post:
        url:  "/api/v1/auth/login"
        name: "LOGIN"
        json:
          email:    "{{ $env.TEST_USER_EMAIL }}"
          password: "{{ $env.TEST_USER_PASSWORD }}"
        capture:
          - json: "$.data.tokens.accessToken"
            as:   "accessToken"

scenarios:
  - name: "Repeated identical query (cache test)"
    weight: 100
    flow:
      - post:
          url:  "/api/v1/rag/query"
          name: "CACHED_RAG_QUERY"
          headers:
            Authorization: "Bearer {{ accessToken }}"
          json:
            # IDENTICAL query every time — should hit Redis cache after first request
            query: "What is machine learning?"
            topK:  5
          expect:
            - statusCode: [200, 429]

      # Check cache stats after each query
      - get:
          url:  "/api/v1/documents/cache/stats"
          name: "CACHE_STATS_CHECK"
          headers:
            Authorization: "Bearer {{ accessToken }}"